#include "Functions.h"

int isvalid(int a, int b) {
	if (((a > N - 1) || (a < 0)) || ((b > N - 1) || (b < 0)))
	{
		cout << "Ошибка! Экземпляра с таким индексом не существует.\n";
		_getch();
		return -1;
	}
	else if (a == b)
	{
		cout << "Ошибка! Экземпляр не может быть записан сам в себя.\n";
		_getch();
		return -2;
	}
	return 0;
}

void shapka(void)
{
	cout << "|------------------------------------------------------------------------------|\n";
	cout << "|----------------------Проекты поиска внеземных сигналов-----------------------|\n";
	cout << "|------------------------------------------------------------------------------|\n";
	cout << "|  Год  |   Научный руководитель  | Диаметр антенны (м)| Рабочая частота (МГц) |\n";
	cout << "|-------|-------------------------|--------------------|-----------------------|\n";
}

void linebuild(void) {
	cout << "|-------|-------------------------|--------------------|-----------------------|\n";
}